
set date "0504"
set design_name "TOP_2306"
 set_top_implementation_options -block_references $GUI_BLOCK_ABSTRACTION_DESIGNS6
set dc_allow_rtl_pg false
#set_top_implementation_options -block_references analogsubsys_top_I_adca_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_adcb_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_adcc_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cpu_adcadata_ahb_sport_ahb_slave_if__AW_32_DW_32I_cpu_adcbdata_ahb_sport_ahb_slave_if__AW_32_DW_32I_cpu_adccdata_ahb_sport_ahb_slave_if__AW_32_DW_32I_cla_adcadata_ahb_sport_ahb_slave_if__AW_32_DW_32I_cla_adcbdata_ahb_sport_ahb_slave_if__AW_32_DW_32I_cla_adccdata_ahb_sport_ahb_slave_if__AW_32_DW_32I_dma_adcadata_ahb_sport_ahb_slave_if__AW_32_DW_32I_dma_adcbdata_ahb_sport_ahb_slave_if__AW_32_DW_32I_dma_adccdata_ahb_sport_ahb_slave_if__AW_32_DW_32I_pga1_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_pga2_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_pga3_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_pga4_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_pga5_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_pga6_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_pga7_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_daca_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_dacb_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss1_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss2_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss3_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss4_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss5_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss6_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_cmpss7_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1I_anasys_apb_sport_apb_if__AW_32_DW_32_SLVNUM_1
#set_top_implementation_options -block_references c28_core_3fffc0_I_ifu_ahb_mport_ahb_master_if__AW_32_DW_32I_rd_ahb_mport_ahb_master_if__AW_32_DW_32I_wr_ahb_mport_ahb_master_if__AW_32_DW_32

#read_verilog ../outputs/dft/analogsubsys_top_scan_0828.v
#read_verilog ../outputs/dft/dsp2302_soc_scan_0828.v
 read_verilog /lustre/home/FDM/DSP2306/TOP_2306/dc_submit/TOP_2306_dc_loop_3.v
 #read_ddc ../outputs/TOP_2306_dc_gtech.ddc
#read_ddc ../outputs/TOP_2306_dc_loop_3.ddc
#read_verilog ../outputs/TOP_2306_dc_loop_3.v


 read_ddc $GUI_DDC_FILE6

current_design ${design_name}



#report_top_implementation_options
#report_block_abstraction

#set constraint_file ../outputs/dft/dsp2302_soc_${date}_scan_incr.sdc
 set constraint_file /lustre/home/FDM/DSP2306/TOP_2306/dc_submit/TOP_2306_pr_200M.sdc
#set constraint_file ../outputs/TOP_2306_dc_loop_3.sdc
source -echo -verbose $constraint_file > ./sdc.log
report_timing -th X353/MI1_X439_u_efuse_top/u_efuse_0/D* > 1
#set_false_path -th u_clb*/i_clb_global  -th u_clb*/o_clb_out  -th u_clb*/i_clb_global
#set_false_path -th u_clb*/o_clb_out -th u_clb*/i_clb_global -th u_clb*/o_clb_out
#report_qor > ./report_qor_verilog.rpt
#report_timing -transition -cap -nets -delay max -max_path 20  > report_timing_verilog.rpt
#set_false_path -th u_clb*/u_clb_input_mux_u_clb_input_mux_in*_sync_mux_out -th  u_clb*/clb_apb_sport_prdata*

#proc_qor
